/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   basictest1.ipp                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: smun <smun@student.42seoul.kr>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/24 20:26:30 by smun              #+#    #+#             */
/*   Updated: 2022/01/28 14:36:44 by smun             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
** Map BasicTest1
**
**  1. 기본 생성자
**  2. size()
**  4. begin(), end(), iterator::operator*()
*/

void	BasicTest1()
{
	Map map;
	PrintSize(map);
	PrintElements(map);
}
